import "./home_style.css";
export  default function Home()
{
    return(
        <>
            <div className="home">
            <h1>React - це JavaScript-бібліотека для розробки інтерфейсів користувачів</h1>
            <p>і вона часто використовується з різними фреймворками для покращення та спрощення розробки. Ось декілька
                найпопулярніших фреймворків та бібліотек, які використовуються з React:</p>

            <h2>Next.js:</h2>
            <p><strong>Опис:</strong> Next.js - це фреймворк для розробки веб-додатків на основі React, який надає
                можливість серверного рендерингу, статичного генерації та інших важливих функцій.</p>
            <p><strong>Переваги:</strong> Підтримка серверного рендерингу, легка конфігурація, автоматична оптимізація
                інфраструктури, можливість створення статичних сайтів.</p>

            <h2>Redux:</h2>
            <p><strong>Опис:</strong> Redux - це управління станом для JavaScript-додатків, яке часто використовується
                разом з React. Він забезпечує простий та передбачуваний спосіб управління станом додатка.</p>
            <p><strong>Переваги:</strong> Однозначний потік даних, легке тестування, підтримка часових подій.</p>

            <h2>Styled Components:</h2>
            <p><strong>Опис:</strong> Styled Components - це бібліотека для написання CSS в JavaScript. Вона дозволяє
                вбудовувати стилі безпосередньо в компоненти React.</p>
            <p><strong>Переваги:</strong> Легкість використання, зручний синтаксис, автоматичне визначення області
                видимості стилів.</p>

            <h2>Material-UI:</h2>
            <p><strong>Опис:</strong> Material-UI - це бібліотека компонентів React, яка використовує дизайн Material
                Design від Google. Вона надає готові до використання компоненти для швидкої і зручної розробки.</p>
            <p><strong>Переваги:</strong> Гарний дизайн, велика кількість готових компонентів, активна спільнота.</p>

            <h2>Gatsby:</h2>
            <p><strong>Опис:</strong> Gatsby - це фреймворк для статичного сайту, який використовує React та GraphQL.
                Він дозволяє легко створювати високопродуктивні статичні веб-сайти.</p>
            <p><strong>Переваги:</strong> Велика екосистема плагінів, автоматична оптимізація зображень, підтримка
                GraphQL.</p>

            <p>Ці фреймворки та бібліотеки роблять розробку з React більш зручною, ефективною та масштабованою. Вибір
                конкретного інструменту може залежати від конкретних потреб та вимог вашого проекту.</p>
            </div>
        </>
    );
}